InformationRegisters/УчетПоСтратегииАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетПоСтратегииАкций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетПоСтратегииАкций/Ext/ManagerModule.bsl
//Функция проверяет настройки программы  учёта по стратегии. 
Функция ПроверитьНастрокуУчетаПоСтратегии(СписокАкций, Дата) Экспорт
	
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Акция",СписокАкций);
	Запрос.Текст ="ВЫБРАТЬ
	              |	УчетПоСтратегииАкцийСрезПоследних.БрокерскийСчет КАК БрокерскийСчет,
	              |	УчетПоСтратегииАкцийСрезПоследних.Акция КАК Акция,
	              |	УчетПоСтратегииАкцийСрезПоследних.Период КАК ДатаНачалаУчетаПоСтратегии,
	              |	УчетПоСтратегииАкцийСрезПоследних.ВестиУчет КАК ВестиУчет
	              |ИЗ
	              |	РегистрСведений.УчетПоСтратегииАкций.СрезПоследних(
	              |			&Дата,
	              |			Акция В (&Акция)
	              |				И ВестиУчет = ИСТИНА) КАК УчетПоСтратегииАкцийСрезПоследних";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ТаблицаАкции = РезультатЗапроса.Выгрузить();
	МассивАкцийСУчетомПоСтратегии = ОбщегоНазначенияКлиентСервер.ПреобразоватьТаблицуЗначенийВМассив(ТаблицаАкции);
	Возврат МассивАкцийСУчетомПоСтратегии;
	
КонецФункции // ()
